In [1]:
import pandas as pd

tb_date = pd.read_csv('../data/raw/dim_date.csv')
tb_date.head()

   date_id        date  year  month month_name  week  quarter
0        1  2023-01-01  2023      1      Enero     1        1
1        2  2023-01-02  2023      1      Enero     1        1
2        3  2023-01-03  2023      1      Enero     1        1
3        4  2023-01-04  2023      1      Enero     1        1
4        5  2023-01-05  2023      1      Enero     1        1

In [2]:
tb_date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 731 entries, 0 to 730
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date_id     731 non-null    int64
 1   date        731 non-null    object
 2   year        731 non-null    int64
 3   month       731 non-null    int64
 4   month_name  731 non-null    object
 5   week        731 non-null    int64
 6   quarter     731 non-null    int64
dtypes: int64(5), object(2)
memory usage: 40.1+ KB

In [3]:
tb_date['date_id'].duplicated().sum()

np.int64(0)

In [4]:
tb_date['month_name'].value_counts()

month_name
Enero         62
Marzo         62
Julio         62
Mayo          62
Diciembre     62
Octubre       62
Agosto        62
Abril         60
Septiembre    60
Junio         60
Noviembre     60
Febrero       57
Name: count, dtype: int64

### Observaciones
- Se puede ver que date est√° en formato texto, se debe cambiar a formato datetime